events/API Call Events/method.getAllForIdentity/APIResponse - method.getAllForIdentity.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing">
	<s:Header></s:Header>
	<s:Body>
		<wsnt:Notify>
			<wsnt:NotificationMessage>
				<wsnt:Topic></wsnt:Topic>
				<wsnt:ProducerReference>
					<wsa:Address>http://www.alert-project.eu/metadata</wsa:Address>
				</wsnt:ProducerReference>
				<wsnt:Message>
					<ns1:event xmlns:ns1="http://www.alert-project.eu/" xmlns:o="http://www.alert-project.eu/ontoevents-mdservice" xmlns:r="http://www.alert-project.eu/rawevents-forum" xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist" xmlns:r2="http://www.alert-project.eu/rawevents-wiki" xmlns:s="http://www.alert-project.eu/strevents-kesi" xmlns:s1="http://www.alert-project.eu/strevents-keui" xmlns:s2="http://www.alert-project.eu/APIcall-request" xmlns:s3="http://www.alert-project.eu/APIcall-response" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.alert-project.eu/alert-root.xsd">
						<ns1:head>
							<ns1:sender>METADATASERVICE</ns1:sender>
							<ns1:timestamp>10000</ns1:timestamp>
							<ns1:sequencenumber>1</ns1:sequencenumber>
						</ns1:head>
						<ns1:payload>
							<ns1:meta>
								<ns1:startTime>10010</ns1:startTime>
								<ns1:endTime>10020</ns1:endTime>
								<!-- name of event -->
								<ns1:eventName>ALERT.Metadata.APICallResponse</ns1:eventName>
								<ns1:eventId>9856</ns1:eventId>
								<ns1:eventType>reply</ns1:eventType>
							</ns1:meta>
							<ns1:eventData>
								<ns1:apiResponse>
									<!-- name of method -->
									<s3:apiCall>method.getAllForIdentity</s3:apiCall>
									<s3:responseData>
										<!-- list (or any other structure) of results -->
										<s3:file>
                                                                                        <s3:fileUri></s3:fileUri>
                                                                                        <s3:fileName>filename1</s3:fileName>
                                                                                        <s3:fileBranch>branch1</s3:fileBranch>
                                                                                        <s3:fileModules>
                                                                                                <s3:moduleUri></s3:moduleUri>
                                                                                                <s3:moduleName>Mod111</s3:moduleName>
                                                                                                <s3:moduleMethods>
                                                                                                        <s3:methodUri></s3:methodUri>
                                                                                                        <s3:methodName>Meth111</s3:methodName>
                                                                                                </s3:moduleMethods>
                                                                                                <s3:moduleMethods>
                                                                                                        <s3:methodUri></s3:methodUri>
                                                                                                        <s3:methodName>Meth112</s3:methodName>
                                                                                                </s3:moduleMethods>
                                                                                        </s3:fileModules>
                                                                                        <s3:fileModules>
                                                                                                <s3:moduleUri></s3:moduleUri>
                                                                                                <s3:moduleName>Mod1211</s3:moduleName>
                                                                                                <s3:moduleMethods>
                                                                                                        <s3:methodUri></s3:methodUri>
                                                                                                        <s3:methodName>Meth121</s3:methodName>
                                                                                                </s3:moduleMethods>
                                                                                        </s3:fileModules>
                                                                                </s3:file>
                                                                                <s3:file>
                                                                                        <s3:fileUri></s3:fileUri>
                                                                                        <s3:fileName>filename2</s3:fileName>
                                                                                        <s3:fileBranch>branch2</s3:fileBranch>
                                                                                        <s3:fileModules>
                                                                                                <s3:moduleUri></s3:moduleUri>
                                                                                                <s3:moduleName>Mod2111</s3:moduleName>
                                                                                                <s3:moduleMethods>
                                                                                                        <s3:methodUri></s3:methodUri>
                                                                                                        <s3:methodName>Meth211</s3:methodName>
                                                                                                </s3:moduleMethods>
                                                                                        </s3:fileModules>
                                                                                </s3:file>
									</s3:responseData>
								</ns1:apiResponse>
							</ns1:eventData>
						</ns1:payload>
					</ns1:event>
				</wsnt:Message>
			</wsnt:NotificationMessage>
		</wsnt:Notify>
	</s:Body>
</s:Envelope>